{
    "  \n      AleksandrL\n      сегодня в 16:33  Жизнь за пределами Metasploit Framework, сравниваем альтернативы Блог компании T.Hunter Информационная безопасность * \n        Из песочницы\n         ДИСКЛЕЙМЕР: Внимание! Вся представленная ниже информация предназначена только для ознакомительного изучения. Автор не несет никакой ответственности за любой причиненный вред с использованием изложенной информации.  Читать далее  Всего голосов 3: ↑3 и ↓0  +3 Просмотры  112 Добавить в закладки  \n    1\n   Комментарии  \n      0\n       ": "https://habr.com/ru/all/",
    "  \n      GarryC\n      сегодня в 16:28  К вопросу о PoL, или импортозамещение бывает Производство и разработка электроники *    Я так и не понял, как работать с этим инфернальным редактором.А речь пойдет о сравнении неизолированных малогабаритных понижающих преобразователей отечественного и импортного произвдства.  Читать далее  Всего голосов 1: ↑1 и ↓0  +1 Просмотры  223 Добавить в закладки  \n    1\n   Комментарии  \n      1\n       ": "https://habr.com/ru/all/",
    " \n      USSCLTD\n      сегодня в 15:55  Оценка рисков информационной безопасности по методике Facilitated Risk Analysis Process Информационная безопасность *    Мы продолжаем серию обзоров  методик оценки рисков информационной безопасности (далее – ИБ), и сегодняшний выпуск будет посвящен методике Facilitated Risk Analysis Process (далее – FRAP).Автор: Евгений Баклушин, старший аналитик УЦСБПочему FRAP?Методика FRAP ориентирована на качественную оценку рисков ИБ с точки зрения их влияния на достижение бизнес-целей организации, а не на выполнение каких-то каталогов мер безопасности или требований аудита. При этом методика обладает несколькими преимуществами по сравнению с количественной оценкой рисков, такими как:Существенное сокращение времени и усилий на проведение оценки.Документация имеет практическое применение, а не представляет из себя бесполезную стопку бумаги.Оценка учитывает не только опыт и навыки специалистов отдела ИБ, но и опыт владельцев бизнес-процессов.Дополнительно может учитываться опыт, полученный из национальных центров реагирования на инциденты ИБ, профессиональных ассоциаций и профильной литературы.  Читать далее  Рейтинг  0 Просмотры  107 Добавить в закладки  \n    0\n   Комментарии  \n      0\n       ": "https://habr.com/ru/all/",
    " \n      CSIRT\n      сегодня в 15:35  ТОП-3 ИБ-событий недели по версии Jet CSIRT Блог компании Инфосистемы Джет Информационная безопасность *    \n\nСегодня в ТОП-3 — уязвимости в среде выполнения контейнеров и ядрах Linux, а также бэкдор, который распространяется через уязвимость в библиотеке Log4J. Новости собирал Андрей Маслов, аналитик центра мониторинга и реагирования на инциденты ИБ Jet CSIRT компании «Инфосистемы Джет».\n\nПодробнее — под катом.  Читать дальше →  Всего голосов 6: ↑6 и ↓0  +6 Просмотры  213 Добавить в закладки  \n    0\n   Комментарии  \n      0\n       ": "https://habr.com/ru/all/",
    "  \n      robertxzc\n      сегодня в 15:20  WFM: планирование рабочего времени и управление персоналом Разработка веб-сайтов *Big Data *1С *Облачные сервисы ERP-системы *    Одной из проблем, свойственным заведениям из сферы HoReCa (рестораны, фастфуды, кафе и отели) и Call Center/Contact Center, является планирование расписания. Проблемы с планированием, в первую очередь, возникают из-за плавающих графиков, различных типов совмещений и построения рабочих графиков исходя из квалификации сотрудников (компетенции). Особенно остро данный вопрос стоит у крупных сетей с большим товарооборотом, где правильная расстановка смен определяет качество обслуживания, оперативность и, самое главное, влияет на выручку и прибыль заведения либо всей сети. Для решения данных вопросов были придуманы многочисленные системы планирования, учета и оптимизации рабочего времени сотрудников (workforce management, WFM), которые уже не первый год пользуются популярностью за рубежом.   Читать далее  Рейтинг  0 Просмотры  300 Добавить в закладки  \n    4\n   Комментарии  \n      0\n       ": "https://habr.com/ru/all/",
    " \n      ph_piter\n      сегодня в 15:03  Обобщенное программирование – обзор реализаций Блог компании Издательский дом «Питер» Программирование *Java *C++ *C# * \n        Перевод\n         Привет, хаброжители! Напоминаем вам о весенней распродаже.В большинстве сильно типизированных языков поддерживается обобщенное программирование. Круг проблем, которые решаются на этих языках, один и тот же, но сами проблемы решались в разное время разными способами, и у каждого из этих способов были свои «за» и «против». Мы рассмотрим историю реализаций обобщенного программирования, чтобы вы могли распробовать его как инженер. Наилучшего подхода не существует, любой подход – это всегда компромисс, при котором одними преимуществами жертвуют ради других. Мы рассмотрим три популярных языка, обогативших нашу индустрию новыми подходами: C++, Java, C#(.Net). Для каждого из рассматриваемых языков мы ответим на следующие вопросы:  Читать далее  Всего голосов 2: ↑2 и ↓0  +2 Просмотры  588 Добавить в закладки  \n    5\n   Комментарии  \n      0\n       ": "https://habr.com/ru/all/",
    "  \n      rikki_tikki\n      сегодня в 14:29  Шаблоны C++: как итерировать по std::tuple — std::apply и еще пара приемов Блог компании OTUS Программирование *C++ * \n        Перевод\n         В предыдущей статье, посвященной перебору элементов кортежей, мы рассмотрели только основы. В результате нашей работы мы реализовали шаблон функции, который принимал кортеж и мог красиво вывести его в консоль. Мы также реализовали версию с оператором <<.Сегодня мы пойдем немного дальше и рассмотрим другие техники. Первая — с применением std::apply из C++17, вспомогательной функции для кортежей. В этой статье также будут рассмотрены некоторые стратегии, позволяющие сделать итерацию более универсальной и обрабатывать кастомные callable-объекты, а не только выводить их в консоль.  Читать далее  Всего голосов 1: ↑1 и ↓0  +1 Просмотры  369 Добавить в закладки  \n    8\n   Комментарии  \n      0\n       ": "https://habr.com/ru/all/",
    " \n      sturex\n      сегодня в 14:26  Структурная адаптация, brand-new самоорганизующаяся сеть на палочках и кружочках Машинное обучение *Искусственный интеллект  \n        Из песочницы\n         Речь в статье пойдет о принципиально новой ИИ методологии, основанной на распространении потока в адаптивной многомерной структуре (фильтре). Ранее подход описан нигде не был, знакомьтесь.  Читать далее  Всего голосов 2: ↑2 и ↓0  +2 Просмотры  307 Добавить в закладки  \n    4\n   Комментарии  \n      0\n       ": "https://habr.com/ru/all/",
    "  \n      Hiro_Protagonist\n      сегодня в 14:25  «Башня из грязи и веток» — номинант на «Небьюлу» от русского программиста Научная фантастика     Ярослав Барсуков — российский программист, живущий на данный момент в Австрии. А еще он — фантаст, пишущий на английском языке, чья повесть «Башня из грязи и веток» в прошлом году вошла в шорт-лист премии «Небьюла». Вместе с рассказами Барсукова она была переведена на русский и недавно издана.Необычный момент, что произведения автора родом из России переводят с английского. Зато в результате такого выбора языка Барсукова заметили на западной «литературной арене»: его повесть высоко оценил, например, Питер Уоттс, включили в несколько значимых списков главных книг года и так далее. Так чем же примечательна повесть? Ярослав работает в литературной традиции Рэя Брэдбери, где элементы фантастики и фэнтези становятся метафорой для того, чтобы читатель мог глубже прочувствовать достаточно реальные проблемы. Создать мир и его магию — явно не первостепенная задача для автора. И вместе с тем это произведение, где важен стиль и образный ряд. Емкие и зримые описания с первых страниц задают ощущение от повести. Оно сумрачное, даже промозглое, с редкими яркими всполохами. Многие говорят, что мир «Башни из грязи и веток» можно назвать стимпанковым, но мне кажется, что правильнее будет характеристика «викторианский магреализм». Ну, да, с дирижаблями. В общем, сам сеттинг получился достаточно колоритным, чтобы вызывать много эмоций, судя по отзывам. Но поговорим о сюжете. Герой, Шэй Эшкрофт, вчера был министром при королеве, но отказался применять на протестующих жителях столицы отравляющий газ. За это ему приходит новое назначение — отправиться в глубокую провинцию Оуэнбег, следить за тем, как продвигается строительство оборонной башни. С одной стороны, башня невероятно важна для жителей и королевы, про нее буквально ставят спектакли в столице. Это будет великое достижение, повод для гордости. С другой — новая работа все равно красноречиво говорит Шэю, что его наказывают за неповиновение.   Читать далее  Всего голосов 7: ↑5 и ↓2  +3 Просмотры  1.1K Добавить в закладки  \n    5\n   Комментарии  \n      1\n       ": "https://habr.com/ru/all/",
    " \n      AlyonaPetrofff\n      сегодня в 14:24  Как выстроить процесс внутреннего обучения сотрудников и получить в 3 раза больше успешных учеников, сэкономив бюджет Блог компании Lineate Управление персоналом *DevOps *    Сегодня расскажу, зачем мы решили проводить DevOps школу, почему решили подключить HR к ее организации, какие инструменты нам в этом помогли. А в качестве итога я расскажу, что выгоднее: проводить внутреннюю школу или отправлять инженеров учиться на внешние курсы.  Читать далее  Всего голосов 2: ↑0 и ↓2  -2 Просмотры  343 Добавить в закладки  \n    6\n   Комментарии  \n      0\n       ": "https://habr.com/ru/all/",
    " \n      MYGAMES\n      сегодня в 14:00  Чек-лист начинающего арт-директора: как организовать работу арт-отдела от малых до распределенных команд Блог компании MY.GAMES Разработка игр *Управление разработкой *Управление персоналом *Игры и игровые консоли     Привет! Меня зовут Денис Рычковский. Всю сознательную жизнь я люблю две вещи: арт и игры. С 2015 года я работаю в геймдев-индустрии, а последние 3,5 года — на позициях лида и арт-директора.Сегодня я хочу поделиться накопившимся опытом и поговорить о самых разных аспектах организации арт-отделов: про особенности и отличие команд в зависимости от их численности, о планировании и коммуникациях, арт-пайплайнах, менеджменте, хантинге и развитии сотрудников — эдакий глоссарий и практические советы, о чем стоит знать каждому арт-лиду.  Итак, начнем  Всего голосов 16: ↑16 и ↓0  +16 Просмотры  292 Добавить в закладки  \n    20\n   Комментарии  \n      0\n       ": "https://habr.com/ru/all/",
    " \n      1shaman\n      сегодня в 14:00  Создание и использование собственных атрибутов AD в PowerShell Блог компании FirstVDS Системное администрирование *PowerShell * \n        Перевод\n         \nВ этой статье я покажу вам, как можно расширять схему AD, создавать нестандартные атрибуты и управлять ими в AD — и всё это с помощью Windows PowerShell. Следуя этому руководству, вы сможете устанавливать и управлять собственными атрибутами AD с помощью PowerShell точно так же, как вы управляете другими атрибутами AD.\n\nСтандартная схема Active Directory содержит большинство атрибутов, которые обычно требуются организации в инфраструктуре AD. Однако стандартных атрибутов не всегда достаточно, когда речь идёт о больших организациях. Когда я управлял Active Directory в крупной школе, меня попросили установить несколько атрибутов для пользователей, которые не были доступны в AD по умолчанию. Тогда мне пришлось расширять схему AD для определения кастомных атрибутов и устанавливать эти атрибуты для пользователей.  Читать дальше →  Всего голосов 2: ↑2 и ↓0  +2 Просмотры  333 Добавить в закладки  \n    4\n   Комментарии  \n      0\n       ": "https://habr.com/ru/all/",
    "  \n      a_che\n      сегодня в 13:49  О бедном абапере замолвите словечко ERP-системы *Карьера в IT-индустрии  \n        Из песочницы\n         Поговорим о том, кто такие ABAP разработчики, как строится их карьера, чем они отличается, а в чем такие же как вы.  Читать далее  Всего голосов 1: ↑1 и ↓0  +1 Просмотры  928 Добавить в закладки  \n    4\n   Комментарии  \n      7\n       ": "https://habr.com/ru/all/",
    " \n      alexbus84\n      сегодня в 13:27  Игра «Ну, погоди!» на Arduino (продолжение) Разработка под Arduino *DIY или Сделай сам Игры и игровые консоли     Всех приветствую! Это продолжение моей публикации «Игра \"Ну, погоди!\" на Arduino». Оформил всё на печатной плате и сделал корпус. Подробности ниже.  Читать далее  Всего голосов 4: ↑2 и ↓2  0 Просмотры  980 Добавить в закладки  \n    2\n   Комментарии  \n      4\n       ": "https://habr.com/ru/all/",
    " \n      xlebanet\n      сегодня в 12:58  Внеземной акт. Изучение секса в космосе Космонавтика Будущее здесь Биология  \n        Перевод\n         В конце прошлого года группа из пяти канадских ученых опубликовала предложение, призывающее крупные космические организации «продвигать новую дисциплину» в исследованиях. Они утверждают, что эта новая дисциплина может оказаться жизненно важной для успеха запланированных усилий по продвижению вглубь космоса и потенциальному строительству внеземных поселений людей. Они назвали эту предположительно революционную новую область исследований «космическая сексология: научное исследование внеземной близости и сексуальности».Другими словами: как заниматься этим в космосе.  Читать далее  Всего голосов 14: ↑7 и ↓7  0 Просмотры  3.4K Добавить в закладки  \n    4\n   Комментарии  \n      1\n       ": "https://habr.com/ru/all/",
    "  \n      arwa\n      сегодня в 12:36  Разбираем алгоритмы компьютерной графики. Часть 2 — «Туннель из демо «Second Reality»» Python *Программирование *Компьютерная анимация *Демосцена     В 1993 году на демопати Assembly, которая проходит в Финляндии, команда Future Crew презентовала свою новую работу «Second Reality».(хороший разбор исходников этой демо можно найти здесь же на Хабре, по этой ссылке «Анализ кода демо Second Reality»)Графические эффекты использованные в демо, в то время производили неизгладимое впечатление. Да и сегодня эту работу можно пересматривать с большим удовольствием. Под DosBox она запускается без каких-либо проблем. Именно это демо многие кодеры называли в качестве источника вдохновения для своих работ и толчком для них самих, чтобы начать заниматься компьютерной графикой.Сегодня мы попробуем воспроизвести один из эффектов демонстрируемых в этом демо, а именно эффект плавающего туннеля.     Читать далее  Всего голосов 9: ↑9 и ↓0  +9 Просмотры  932 Добавить в закладки  \n    25\n   Комментарии  \n      6\n       ": "https://habr.com/ru/all/",
    " \n      drise\n      сегодня в 12:07  Переоценённые добавки: выполняет ли теанин рекламные обещания? Мозг Здоровье     Разбираю, насколько честны российские производители теанина и что думает о нём наука. Спойлер: правды почти ноль.  Читать далее  Всего голосов 8: ↑6 и ↓2  +4 Просмотры  1.3K Добавить в закладки  \n    5\n   Комментарии  \n      6\n       ": "https://habr.com/ru/all/",
    " \n      ris58h\n      сегодня в 12:04  Баги в Hello World Python *Программирование *Совершенный код *C * \n        Перевод\n         Hello World, должно быть, самая часто создаваемая компьютерная программа. Уже десятилетия это первая программа, которую пишут люди, когда начинают изучение нового языка программирования.Конечно же эта простая программа не должна иметь баги. Верно?  Читать далее  Всего голосов 9: ↑6 и ↓3  +3 Просмотры  2.3K Добавить в закладки  \n    7\n   Комментарии  \n      7\n       ": "https://habr.com/ru/all/",
    " \n      Bright_Translate\n      сегодня в 12:00  Электромеханический 7-сегментный дисплей своими руками Блог компании RUVDS.com Производство и разработка электроники *DIY или Сделай сам Электроника для начинающих  \n        Перевод\n      \n        Tutorial\n         \nЛюбительский проект по сборке с нуля уникального настенного дисплея с функцией часов и возможностью дополнительного апгрейда. Вооружаемся шаговыми двигателями, МДФ, платами, кучей проводов и вперёд.  Читать дальше →  Всего голосов 18: ↑17 и ↓1  +16 Просмотры  2.1K Добавить в закладки  \n    25\n   Комментарии  \n      9\n       ": "https://habr.com/ru/all/",
    " \n      classicalhypnosis\n      сегодня в 11:31  Как психотравмы определяют поведение. И почему гипнотерапия бывает так эффективна в лечении страхов Здоровье     Откуда берутся страхи и фобии? Как они формируются?У человека, как и у компьютера, есть BIOS, в котором может произойти сбой и в результате возникает вирусная программа - ПСИХОТРАВМА, когда же компьютер глючит – у человека проявляются СИМПТОМЫ.Объясняю:Роды прошли с осложнениями, например не вовремя перерезали пуповину / умер близкий / попал в аварию с тяжелыми последствиями / разбилось сердце от предательства / долго выживал в стрессе. А пуповина это прямая связь с мамой, которая так любит свое дитя. Это маленькая ошибка могла оставить значимый рубец в психике ребенка, на уровне BIOS (подсознания) остался страх потери любви.Событие забылось. Прошло лет 5-10, родители поссорились и разошлись. Для ребенка это был сильный стресс. В этот момент сформировалась ПСИХОТРАВМА.Дальше ребенок почувствовал нехватку любви, начал заедать, ибо раньше подсознание отметило, что еда - признак любви. Еда есть та недостающая любовь. И в это время сформировался СИМПТОМ - переедание.Взрослый человек будет сознательно пытаться изменить реакцию.– собрать волю в кулак, подавить напряжение на время. Но в итоге получает новую порцию стресса от неудачной попытки все наладить.Важно понимать, что нервная система накапливает реакции на стресс в виде телесных зажимов.Поэтому в трудную минуту ощущаем «как сдавливает горло от несправедливости», «колит в груди от обиды», «подкашиваются ноги от страха»…Запомните, чтобы починить систему, нужен работающий компьютер, а не выключенный. Гипноз - не сон.В режиме бодрствования до BIOS (до подсознания) тоже не добраться. Нужно сначала перейти в режим редактирования опыта.  Читать далее  Всего голосов 7: ↑1 и ↓6  -5 Просмотры  872 Добавить в закладки  \n    12\n   Комментарии  \n      4\n       ": "https://habr.com/ru/all/"
}